app/controllers/destinos_controller.rb

SELECT * FROM `destinos` WHERE (nome LIKE '%t%')
---
  def index
    @menu = "destinos"
    @busca = params[:busca]
    @destinos = @busca.blank? ? Destino.all : Destino.search(@busca)

INSERT INTO `destinos` (`status`, `updated_at`, `nome`, `created_by`, `emails`, `updated_by`, `tipo`, `created_at`) VALUES('ativo', '2009-06-11 02:02:38', 'Camara municipal de porto alegre', NULL, 'marcia@camarapoa.rs.gov.br;hgtesta@gmail.com', NULL, 'Setor', '2009-06-11 02:02:38')
---
  def create
    @destino = Destino.new(params[:destino])
    if @destino.save

SELECT * FROM `destinos` WHERE (`destinos`.`id` = 1)
---
  def edit
    @menu = "destinos"
    @destino = Destino.find(params[:id])

SELECT * FROM `destinos` WHERE (`destinos`.`id` = 1)
UPDATE `destinos` SET `nome` = 'eeba ee hique', `updated_at` = '2009-05-03 00:30:20' WHERE `id` = 1
---
  def update
    @destino = Destino.find(params[:id])
    if @destino.update_attributes(params[:destino])

SELECT * FROM `destinos` WHERE (`destinos`.`id` = 2)
DELETE FROM `destinos` WHERE `id` = 2
---
  def destroy
  	@destino = Destino.find(params[:id])
  	begin
	  	if @destino.destroy