app/controllers/users_controller.rb

SELECT * FROM `users` ORDER BY name
---
  def index
    @users = User.all(:order => :name)

INSERT INTO `users` (`name`, `salt`, `hashed_password`, `created_by`, `updated_by`, `login`, `update_at`, `email`, `created_at`) VALUES('henrique Testa', 'RaWKb636mg', '4afd264a8019b5a2b7a37fb87b59f1b800113d17', NULL, NULL, 'hique', NULL, 'hique@gmail.com', '2009-05-03 12:27:02')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    user = User.find(params[:id])
    if user.destroy